---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.ForwardIterator
source: html/fa11671d-4078-a3e6-2fdd-cb38a5eec5f7.htm
---
# Autodesk.Revit.DB.PanelTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PanelTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.